In [10]:
# import the library
import pandas as pd

# read the dataset
df = pd.read_csv('data_scientist_hr.csv')

In [ ]:
df[]

In [14]:
d = df[df['enrolled_university']=='Part time course']

In [19]:
d['relevent_experience'].value_counts(normalize=True)*100

Has relevent experience    68.196995
No relevent experience     31.803005
Name: relevent_experience, dtype: float64

In [21]:
d['relevent_experience'].value_counts(normalize=True)[0]*100

68.19699499165276

In [11]:
df.head() # display few rows

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

In [3]:
# get the data with training_hours<50 
df = df[df['training_hours']<50]

In [4]:
# get value counts of 'experience' column
df['experience'].value_counts()

>20    1717
4       736
5       724
3       682
2       625
6       622
7       556
10      517
9       490
8       395
15      347
11      341
14      291
1       284
<1      278
16      255
12      236
13      215
17      188
19      155
18      145
20       81
Name: experience, dtype: int64

- As we can see that >20 and <1 needs to be modified before proceeding further.

In [5]:
# for simplicity ,replace >20 with 20.1 and <1 with .9
df['experience'] = df['experience'].replace(['>20','<1'],['20.1','.9'])

In [6]:
# get the data type
# its data type is object here
df['experience'].dtype

dtype('O')

In [7]:
# change the datatype to float
df['experience'] = df['experience'].astype('float')

In [8]:
# proportion of data scientists having greater than 10 years of experience

# get the data for experience greater than 10
Exp_MoreThan_10 = df['experience']>10

Exp_MoreThan_10.value_counts(normalize=True)*100

False    59.945532
True     40.054468
Name: experience, dtype: float64

In [9]:
proportion = Exp_MoreThan_10.value_counts(normalize=True)[1]*100

print('Proportion of data scientists having greater than 10 years of experience',round(proportion,2),'%')

Proportion of data scientists having greater than 10 years of experience 40.05 %

In [ ]:
"First, for data scientists with Arts as their major discipline, 
calculate the proportion (as a percentage) that are looking for new jobs. 
Then perform the same calculation for those with no major discipline. 
What is the result when you take the proportion for Arts majors and subtract the proportion for those with no major? "

In [22]:
# import the library
import pandas as pd

# read the dataset
df = pd.read_csv('data_scientist_hr.csv')

In [27]:
df[df['major_discipline']=='Arts'].head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
19,11399,city_13,0.827,Female,Has relevent experience,no_enrollment,Graduate,Arts,4,NaN,NaN,1,132,1
27,28476,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Arts,5,NaN,NaN,2,72,0
154,12154,city_16,0.910,NaN,Has relevent experience,no_enrollment,Masters,Arts,>20,1000-4999,NGO,>4,55,0
167,30496,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Arts,>20,100-500,Pvt Ltd,>4,11,0
416,10529,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Arts,>20,<10,Pvt Ltd,1,102,0

In [28]:
d = df[df['major_discipline']=='Arts']

In [31]:
d['target'].value_counts(normalize=True)

0    0.790514
1    0.209486
Name: target, dtype: float64

In [34]:
k = df[df['major_discipline'].isnull()]

In [35]:
k['target'].value_counts(normalize=True)

0    0.804835
1    0.195165
Name: target, dtype: float64

In [26]:
df.isna().any()

enrollee_id               False
city                      False
city_development_index    False
gender                     True
relevent_experience       False
enrolled_university        True
education_level            True
major_discipline           True
experience                 True
company_size               True
company_type               True
last_new_job               True
training_hours            False
target                    False
dtype: bool